HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
/* The MAC address array is not declared const as the MAC address will
normally be read from an EEPROM and not hard coded (in real deployed
applications).*/
static uint8_t ucMACAddress[6] =
{
    configMAC_ADDR0,
    configMAC_ADDR1,
    configMAC_ADDR2,
    configMAC_ADDR3,
    configMAC_ADDR4,
    configMAC_ADDR5
}; //XXX

/* Define the network addressing.  These parameters will be used if either
ipconfigUDE_DHCP is 0 or if ipconfigUSE_DHCP is 1 but DHCP auto configuration
failed. */
static const uint8_t ucIPAddress[4] =
{
    configIP_ADDR0,
    configIP_ADDR1,
    configIP_ADDR2,
    configIP_ADDR3
};
static const uint8_t ucNetMask[4] =
{
    configNET_MASK0,
    configNET_MASK1,
    configNET_MASK2,
    configNET_MASK3
};
static const uint8_t ucGatewayAddress[4] =
{
    configGATEWAY_ADDR0,
    configGATEWAY_ADDR1,
    configGATEWAY_ADDR2,
    configGATEWAY_ADDR3
};

/* The following is the address of an OpenDNS server. */
static const uint8_t ucDNSServerAddress[4] =
{
    configDNS_SERVER_ADDR0,
    configDNS_SERVER_ADDR1,
    configDNS_SERVER_ADDR2,
    configDNS_SERVER_ADDR3
};

extern int32_t littlFs_init (void);
extern void vSerialPutString(const signed char * pcString, unsigned short usStringLength);

/**
 * @brief Application task startup hook.
 */
void vApplicationDaemonTaskStartupHook (void);

/**
 * @brief Initializes the board.
 */
void prvMiscInitialization (void);
static BaseType_t prvShouldAutoProvisionFromClientCredentials( void );
static void prvDisplayInitialize( void );
static void prvDisplayWriteBanner( void );
static void prvDisplayWrite( const char * pcMessage );

extern void UserInitialization (void);
extern void CLI_Support_Settings (void);
extern void vUARTCommandConsoleStart (uint16_t usStackSize, UBaseType_t uxPriority);
extern void vRegisterSampleCLICommands (void);

static BaseType_t xDisplayInitialized = pdFALSE;

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: main_task
 * Description  : The application entry point from a power on reset is PowerON_Reset_PC()
 *                in resetprg.c.
 * Return Value : .
 *********************************************************************************************************************/
void main_task(void *pvParameters)
{
    int32_t xResults;
    int32_t xCacheInitResult = LFS_ERR_OK;
    int32_t Time2Wait = 10000;
    BaseType_t xProceedToDemo = pdTRUE;
    extern void vRegisterSampleCLICommands (void);
    extern void vUARTCommandConsoleStart (uint16_t usStackSize, UBaseType_t uxPriority);
    extern TaskHandle_t xCLIHandle;

    (void) pvParameters;

    prvMiscInitialization();
    UserInitialization();

    /* Phase 8b 第3次 段階5-4c-3 (#57): code flash 排他制御用 semaphore を初期化。
     * sdcard_task / firm_update.c が xSemaphoreTake/Give する。
     * legacy aws_demos の main.c L164-165 と同じパターン。 */
    {
        extern SemaphoreHandle_t xSemaphoreCodeFlashAccess;
        xSemaphoreCodeFlashAccess = xSemaphoreCreateBinary();
        xSemaphoreGive( xSemaphoreCodeFlashAccess );
    }

    prvDisplayInitialize();
    prvDisplayWrite("FreeRTOS init\r\n");

    /* Phase 8b 第3次 段階5-4c-3 (#57): SD update task を起動。
     * sdcard_task は SD カード挿抜検出 + 自動 mount + firm_update 進捗監視 +
     * GUI 連動を行う。gui_task の完了通知を待ってから動き始める設計。 */
    {
        static TaskHandle_t s_sdcard_task_handle = NULL;
        if( s_sdcard_task_handle == NULL )
        {
            ( void ) xTaskCreate( sdcard_task,
                                  "sdcard",
                                  appmainSDCARD_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainSDCARD_TASK_PRIORITY,
                                  &s_sdcard_task_handle );
            get_task_info()->sdcard_task_handle = s_sdcard_task_handle;
        }
    }

    /* Phase 8b 第3次 段階5-5 (#58): serial flash (Quad SPI) task を起動。
     * Macronix MX25L 32Mbit に対する erase/write/read テスト harness。
     * gui_task からの xTaskNotifyGive で wake-up される (段階5-x で復活)。 */
    {
        static TaskHandle_t s_serial_flash_task_handle = NULL;
        if( s_serial_flash_task_handle == NULL )
        {
            ( void ) xTaskCreate( serial_flash_task,
                                  "serial_flash",
                                  appmainSERIAL_FLASH_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainSERIAL_FLASH_TASK_PRIORITY,
                                  &s_serial_flash_task_handle );
            get_task_info()->serial_flash_task_handle = s_serial_flash_task_handle;
        }
    }

    /* Phase 8b 第3次 段階5-6 (#59): audio task placeholder を起動。
     * legacy aws_demos と同じく実装は永久 sleep のみで、実 audio 機能は無い。
     * 段階5-6b 以降で SSI/DMA を取り込んだ際に本実装に差し替える。 */
    {
        static TaskHandle_t s_audio_task_handle = NULL;
        if( s_audio_task_handle == NULL )
        {
            ( void ) xTaskCreate( audio_task,
                                  "audio",
                                  appmainAUDIO_TASK_STACK_SIZE,
                                  get_task_info(),
                                  appmainAUDIO_TASK_PRIORITY,
                                  &s_audio_task_handle );
            get_task_info()->audio_task_handle = s_audio_task_handle;
        }
    }

#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    {
        /* Register the standard CLI commands. */
        extern void vRegisterSdcardCLICommands(void); /* Phase 8b 第3次 段階5-4a (#53) */
        vRegisterSampleCLICommands();
        vRegisterSdcardCLICommands();
        vUARTCommandConsoleStart(mainUART_COMMAND_CONSOLE_STACK_SIZE, mainUART_COMMAND_CONSOLE_TASK_PRIORITY);
    }
#endif

    xResults = littlFs_init();
    prvDisplayWrite((LFS_ERR_OK == xResults) ? "LittleFS OK\r\n" : "LittleFS ERROR\r\n");

    xMQTTAgentInit();
    prvDisplayWrite("MQTT agent init\r\n");

    if (LFS_ERR_OK == xResults)
    {
        xCacheInitResult = vprvCacheInit();
    }

#if (ENABLE_CREDENTIAL_BY_CLI == 1)
    if( ( LFS_ERR_OK == xResults ) &&
        ( LFS_ERR_OK == xCacheInitResult ) &&
        ( pdTRUE == prvShouldAutoProvisionFromClientCredentials() ) )
    {
        vAssignCredentials();
    }
#endif

#if (ENABLE_CREDENTIAL_BY_CLI == 0)
    vAssignCredentials();
#else
    xProceedToDemo = ApplicationCounter(Time2Wait);
#endif

    if (pdTRUE == xProceedToDemo)
    {
    #if (ENABLE_CREDENTIAL_BY_CLI == 1)
        /* Remove CLI task before going to demo. */
        /* CLI and Log tasks use common resources but are not exclusively controlled. */
        /* For this reason, the CLI task must be deleted before executing the Demo. */
        if( xCLIHandle != NULL )
        {
            vTaskDelete(xCLIHandle);
        }
    #endif

        /* Initialise the RTOS's TCP/IP stack.  The tasks that use the network
            are created in the vApplicationIPNetworkEventHook() hook function
            below.  The hook function is called when the network connects. */
        prvDisplayWrite("Network init\r\n");

