HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/application_code/main.c
static void prvDisplayWrite( const char * pcMessage )
{
    if( ( pdFALSE != xDisplayInitialized ) && ( NULL != pcMessage ) )
    {
        vApplicationLcdLogString(pcMessage, (unsigned short) strlen(pcMessage));
    }
}
/*-----------------------------------------------------------*/

void vApplicationLcdLogString( const char * pcMessage, unsigned short usStringLength )
{
    /* Stub: r_simple_graphic_rx removed.
     * Will be replaced with emWin GUI_DispString() in 段階5-2.
     * UART logging continues unaffected. */
    (void) pcMessage;
    (void) usStringLength;
}
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationDaemonTaskStartupHook
 * Description  : .
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationDaemonTaskStartupHook(void)
{
}
/*****************************************************************************************
End of function vApplicationDaemonTaskStartupHook
****************************************************************************************/

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationGetIdleTaskMemory
 * Description  : configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 *                implementation of vApplicationGetIdleTaskMemory() to provide the memory that is
 *                used by the Idle task.
 * Arguments    : ppxIdleTaskTCBBuffer
 *              : ppxIdleTaskStackBuffer
 *              : pulIdleTaskStackSize
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationGetIdleTaskMemory(StaticTask_t ** ppxIdleTaskTCBBuffer,
                                    StackType_t ** ppxIdleTaskStackBuffer,
                                    uint32_t * pulIdleTaskStackSize)
{
    /* If the buffers to be provided to the Idle task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[configMINIMAL_STACK_SIZE];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle
     * task's state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}
/*****************************************************************************************
End of function vApplicationGetIdleTaskMemory
****************************************************************************************/
/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationGetTimerTaskMemory
 * Description  : This is to provide the memory that is used by the RTOS daemon/time task.
 *
 *                If configUSE_STATIC_ALLOCATION is set to 1, so the application must provide an
 *                implementation of vApplicationGetTimerTaskMemory() to provide the memory that is
 *                used by the RTOS daemon/time task.
 * Arguments    : ppxTimerTaskTCBBuffer
 *              : ppxTimerTaskStackBuffer
 *              : pulTimerTaskStackSize
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationGetTimerTaskMemory(StaticTask_t ** ppxTimerTaskTCBBuffer,
                                    StackType_t ** ppxTimerTaskStackBuffer,
                                    uint32_t * pulTimerTaskStackSize)
{
    /* If the buffers to be provided to the Timer task are declared inside this
     * function then they must be declared static - otherwise they will be allocated on
     * the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle
     * task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
     * Note that, as the array is necessarily of type StackType_t,
     * configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}
/*****************************************************************************************
End of function vApplicationGetTimerTaskMemory
****************************************************************************************/
/*-----------------------------------------------------------*/

#ifndef iotconfigUSE_PORT_SPECIFIC_HOOKS

/**********************************************************************************************************************
 * Function Name: vApplicationMallocFailedHook
 * Description  : Warn user if pvPortMalloc fails.
 *
 *                Called if a call to pvPortMalloc() fails because there is insufficient
 *                free memory available in the FreeRTOS heap.  pvPortMalloc() is called
 *                internally by FreeRTOS API functions that create tasks, queues, software
 *                timers, and semaphores.  The size of the FreeRTOS heap is set by the
 *                configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h.
 * Argument     :
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationMallocFailedHook( void )
    {
        configPRINT_STRING(("ERROR: Malloc failed to allocate memory\r\n"));
        taskDISABLE_INTERRUPTS();

        for (;;)
        {
            /* Loop forever */
        }
    }
/*****************************************************************************************
End of function vApplicationMallocFailedHook
****************************************************************************************/

/*-----------------------------------------------------------*/

/**********************************************************************************************************************
 * Function Name: vApplicationStackOverflowHook
 * Description  : Loop forever if stack overflow is detected.
 *                If configCHECK_FOR_STACK_OVERFLOW is set to 1,
 *                this hook provides a location for applications to
 *                define a response to a stack overflow.
 *
 *                Use this hook to help identify that a stack overflow
 *                has occurred.
 * Arguments    : xTask
 *              : pcTaskName
 * Return Value : .
 *********************************************************************************************************************/
void vApplicationStackOverflowHook(TaskHandle_t xTask,
                                        char * pcTaskName)
    {
        configPRINT_STRING(("ERROR: stack overflow\r\n"));
        portDISABLE_INTERRUPTS();

        /* Unused Parameters */
        (void) xTask;
        (void) pcTaskName;

        for (;;)
        {
            /* Loop forever */
        }
    }
/*****************************************************************************************
End of function vApplicationStackOverflowHook
****************************************************************************************/

